# Exercise 1

In [1]:
import numpy as np
import pandas as pd

In [2]:
array=np.arange(1,11)

In [3]:
reshape=array.reshape(2,5)

In [4]:
reshape

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

# Exercise 2

In [5]:
array_2=np.arange(1,21)

In [6]:
extracted_elements=array_2[5:16]
extracted_elements

array([ 6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16])

# Exercise 3

In [7]:
fruits = pd.Series({'apples': 3, 'bananas': 2, 'oranges': 1})
fruits

apples     3
bananas    2
oranges    1
dtype: int64

In [8]:
fruits['pears'] = 4
fruits

apples     3
bananas    2
oranges    1
pears      4
dtype: int64

# Exercise 4

In [9]:
data = {
    "name": ["Ziya", "Niom", "Nasriya", "Darsan", "Vaiga", "Himal", "Aleena", "Davis", "Miya", "Rocky"],
    "age": [26, 32, 29, 24, 28, 35, 30, 27, 31, 33],
    "gender": ["Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male"]
}
df = pd.DataFrame(data)
print(df)

      name  age  gender
0     Ziya   26  Female
1     Niom   32    Male
2  Nasriya   29  Female
3   Darsan   24    Male
4    Vaiga   28  Female
5    Himal   35    Male
6   Aleena   30  Female
7    Davis   27    Male
8     Miya   31  Female
9    Rocky   33    Male

# Exercise 5

In [10]:
df['occupation'] = ["Programmer", "Manager", "Analyst","Manager","Analyst","Programmer","Analyst","Manager","Analyst","Programmer"]
print(df)

      name  age  gender  occupation
0     Ziya   26  Female  Programmer
1     Niom   32    Male     Manager
2  Nasriya   29  Female     Analyst
3   Darsan   24    Male     Manager
4    Vaiga   28  Female     Analyst
5    Himal   35    Male  Programmer
6   Aleena   30  Female     Analyst
7    Davis   27    Male     Manager
8     Miya   31  Female     Analyst
9    Rocky   33    Male  Programmer

# Exercise 6

In [11]:
selected_rows = df[df['age'] >= 30]
selected_rows

     name  age  gender  occupation
1    Niom   32    Male     Manager
5   Himal   35    Male  Programmer
6  Aleena   30  Female     Analyst
8    Miya   31  Female     Analyst
9   Rocky   33    Male  Programmer

# Exercise 7

In [12]:
df.to_csv("dataframe.csv", index=False)
df_read = pd.read_csv("dataframe.csv")
print(df_read)

      name  age  gender  occupation
0     Ziya   26  Female  Programmer
1     Niom   32    Male     Manager
2  Nasriya   29  Female     Analyst
3   Darsan   24    Male     Manager
4    Vaiga   28  Female     Analyst
5    Himal   35    Male  Programmer
6   Aleena   30  Female     Analyst
7    Davis   27    Male     Manager
8     Miya   31  Female     Analyst
9    Rocky   33    Male  Programmer